In [1]:
import pandas as pd
import re

In [5]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
df3 = pd.read_csv('Filename.csv')

In [3]:
((df3['magType'] == 'ml') & (df3['type'] == 'explosion')).sum()

79

In [6]:
alaska = df3[df3['place'].str.contains('Alaska')]
alaska['dist'] = alaska.loc[:,'place'].apply(lambda x: int(re.findall(r'[\d]+', x)[0]) if re.findall(r'[\d]+', x) else 0)
alaska.loc[alaska['dist'].lt(100), 'mag'].mean()

1.3744199088678577

In [21]:
df3['date'] = pd.to_datetime(df3['time'], unit='ms')
df3.groupby(df3['date'].dt.quarter).agg({'mag':'mean'})

           mag
date
3     1.466735
4     1.536045